# Soal 1

In [3]:
import pandas as pd
import ___ as np
sales_dictionary_2018 = {'name': ['Michael', 'Ana'], 
                     'revenue': ['1000', '2000'], 
                     'number_of_itmes_sold': [5, 7]}
sales_df_2018 = ___.DataFrame(___)
___.head()

      name revenue  number_of_itmes_sold
0  Michael    1000                     5
1      Ana    2000                     7

In [4]:
sales_dictionary_2019 = {'name': ['Michael', 'Ana', 'George'], 
                     'revenue': ['1000', '3000', '2000'], 
                     'number_of_itmes_sold': [5, 8, 7]}
sales_df_2019 = ___.DataFrame(___)
sales_df_2019.___()

      name revenue  number_of_itmes_sold
0  Michael    1000                     5
1      Ana    3000                     8
2   George    2000                     7

In [5]:
pd.concat([___, ___], ignore_index=___)

      name revenue  number_of_itmes_sold
0  Michael    1000                     5
1      Ana    2000                     7
2  Michael    1000                     5
3      Ana    3000                     8
4   George    2000                     7

In [6]:
rep_info_dictionary = {___: [], 
                     ____: []}
rep_info_df = pd.DataFrame(rep_info_dictionary)
rep_info_df.head()

      name  location
0      Ana  New York
1  Michael  San Jose
2   George  New York

In [7]:
sales_df_2019.___(rep_info_df, on=___)

      name revenue  number_of_itmes_sold  location
0  Michael    1000                     5  San Jose
1      Ana    3000                     8  New York
2   George    2000                     7  New York

In [8]:
sales_df_2019.set_index(___, inplace=True)
___.___()

        revenue  number_of_itmes_sold
name
Michael    1000                     5
Ana        3000                     8
George     2000                     7

In [9]:
rep_info_df.___(___, ___)
rep_info_df.head()

         location
name
Ana      New York
Michael  San Jose
George   New York

In [10]:
____.___(___)

        revenue  number_of_itmes_sold  location
name
Michael    1000                     5  San Jose
Ana        3000                     8  New York
George     2000                     7  New York

# Soal 2

In [1]:
import ___
# Buat series of int (s1) dan series of string (s2)
s1 = ___
s2 = ___
# Terapkan method append
s2_append_s1 = ___
print("Series - append:\n", ___)
# Buat dataframe df1 dan df2
df1 = ___({___:___,
		   ___:___})
df2 = ___({___:___,
		   ___:___})

# Untuk prakteknya terapkanlah method append dengan series s1 dan dataframe df1 ditempatkan setelah series s2 dan dataframe df2 masing-masingnya.
# Terapkan method append
df2_append_df1 = ___
print("Dataframe - append:\n", ___)

Series - append:
 0    1
1    2
2    3
3    4
4    5
5    6
0    a
1    b
2    c
3    d
4    e
5    f
dtype: object
Dataframe - append:
    b  a
0  1  3
1  2  4
0  3  1
1  4  2

In [2]:
import ___
# Buat dataframe df1 dan df2
df1 = pd.DataFrame({
   'key':['k1','k2','k3','k4','k5'],
   'val1':[200, 500, 0, 500, 100],
   'val2':[30, 50, 100, 20, 10]
})
df2 = pd.DataFrame({
   'key':['k1','k3','k5','k7','k10'],
   'val3':[1,2,3,4,5],
   'val4':[6,7,8,8,10]
})
# Penerapan join dengan menggunakan set_index dan keyword how
join_df = ___
print(___)

      val1   val2  val3  val4
key
k1   200.0   30.0   1.0   6.0
k10    NaN    NaN   5.0  10.0
k2   500.0   50.0   NaN   NaN
k3     0.0  100.0   2.0   7.0
k4   500.0   20.0   NaN   NaN
k5   100.0   10.0   3.0   8.0
k7     NaN    NaN   4.0   8.0